doc: mermaid diagrams
